NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM24/MGM240PB32VNA.svd
        <register>
          <name>RAMBIASCONF</name>
          <description>Configure RAM bias configure bits.</description>
          <addressOffset>0x30C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>RAMBIASCTRL</name>
              <description>RAM Bias Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No</name>
                  <description>None</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSB100</name>
                  <description>Voltage Source Bias 100mV</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSB200</name>
                  <description>Voltage Source Bias 200mV</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSB300</name>
                  <description>Voltage Source Bias 300mV</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSB400</name>
                  <description>Voltage Source Bias 400mV</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIORAMRETNCTRL</name>
          <description>Configure SEQRAM Retention controls.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000103</resetMask>
          <fields>
            <field>
              <name>SEQRAMRETNCTRL</name>
              <description>SEQRAM Retention Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLON</name>
                  <description>SEQRAM not powered down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0</name>
                  <description>Power down SEQRAM block 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK1</name>
                  <description>Power down SEQRAM block 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLOFF</name>
                  <description>Power down all SEQRAM blocks</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRCRAMRETNCTRL</name>
              <description>FRCRAM Retention Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLON</name>
                  <description>FRCRAM not powered down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLOFF</name>
                  <description>Power down FRCRAM</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIOECCCTRL</name>
          <description>Configure to set RAM ECC control.</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000303</resetMask>
          <fields>
            <field>
              <name>SEQRAMECCEN</name>
              <description>SEQRAM ECC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQRAMECCEWEN</name>
              <description>SEQRAM ECC Error Writeback Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMECCEN</name>
              <description>FRCRAM ECC Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMECCEWEN</name>
              <description>FRCRAM ECC Error Writeback Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQRAMECCADDR</name>
          <description>Read to get status of the SEQRAM ECC error address.</description>
          <addressOffset>0x410</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQRAMECCADDR</name>
              <description>SEQRAM ECC Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRCRAMECCADDR</name>
          <description>Read to get status of the FRCRAM ECC error address.</description>
          <addressOffset>0x414</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRCRAMECCADDR</name>
              <description>FRCRAM ECC Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHERAMRETNCTRL</name>
          <description>Configure Host ICACHERAM retention configuration.</description>
          <addressOffset>0x418</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>RAMRETNCTRL</name>
              <description>ICACHERAM Retention control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLON</name>
                  <description>None of the Host ICACHE RAM blocks powered down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLOFF</name>
                  <description>Power down all Host ICACHE RAM blocks</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMEM0PORTMAPSEL</name>
          <description>Configure DMEM0 port remap selection.</description>
          <addressOffset>0x41C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00007905</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>LDMAPORTSEL</name>
              <description>LDMA portmap selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRWAESPORTSEL</name>
              <description>SRWAES portmap selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBSRWPORTSEL</name>
              <description>AHBSRW portmap selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRWECA0PORTSEL</name>
              <description>SRWECA0 portmap selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRWECA1PORTSEL</name>
              <description>SRWECA1 portmap selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MVPAHBDATA0PORTSEL</name>
              <description>MVPAHBDATA0 portmap selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MVPAHBDATA1PORTSEL</name>
              <description>MVPAHBDATA1 portmap selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MVPAHBDATA2PORTSEL</name>
              <description>MVPAHBDATA2 portmap selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROOTDATA0</name>
          <description>Generic data space for user to pass to root, e.g., address of struct in mem</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROOTDATA1</name>
          <description>Generic data space for user to pass to root, e.g., address of struct in mem</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROOTLOCKSTATUS</name>
          <description>This register returns the status of the SE managed locks.</description>
          <addressOffset>0x608</addressOffset>
          <access>read-only</access>
          <resetValue>0x007F0107</resetValue>
          <resetMask>0x807F0107</resetMask>
          <fields>
            <field>
              <name>BUSLOCK</name>
              <description>Bus Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REGLOCK</name>
              <description>Register Lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MFRLOCK</name>
              <description>Manufacture Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROOTDBGLOCK</name>
              <description>Root Debug Lock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USERDBGAPLOCK</name>
              <description>User Debug Access Port Lock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USERDBGLOCK</name>
              <description>User Invasive Debug Lock</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USERNIDLOCK</name>
              <description>User Non-invasive Debug Lock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USERSPIDLOCK</name>
              <description>User Secure Invasive Debug Lock</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USERSPNIDLOCK</name>
              <description>User Secure Non-invasive Debug Lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RADIOIDBGLOCK</name>
              <description>Radio Invasive Debug Lock</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RADIONIDBGLOCK</name>
              <description>Radio Non-invasive Debug Lock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSEUNLOCKED</name>
              <description>E-Fuse Unlocked</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROOTSESWVERSION</name>
          <description>SE Software version </description>
          <addressOffset>0x60C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWVERSION</name>
              <description>SW Version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
