NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM24/MGM240PB32VNA.svd
        <register>
          <name>ANTSWCTRL</name>
          <description>No Description</description>
          <addressOffset>0x1C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x003C0000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>ANTDFLTSEL</name>
              <description>Ant Default Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTCOUNT</name>
              <description>Total Ant count</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTSWTYPE</name>
              <description>Ant Switch Type</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>US_2</name>
                  <description>2us ant switching</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>US_4</name>
                  <description>4us ant switching</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>US_6</name>
                  <description>6us ant switching</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>US_8</name>
                  <description>8us ant switching</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANTSWRST</name>
              <description>Ant SW rst pulse</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CFGANTPATTEN</name>
              <description>Configure Ant Pattern Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTSWENABLE</name>
              <description>Ant sw enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTDSTOPPULSECNT</name>
              <description>Extend Stop Pulse Counter</description>
              <bitOffset>17</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTSWCTRL1</name>
          <description>No Description</description>
          <addressOffset>0x1C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x0006AAAA</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMEPERIOD</name>
              <description>Time Period of xtal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTSWSTART</name>
          <description>No Description</description>
          <addressOffset>0x1C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>ANTSWSTARTTIM</name>
              <description>Ant switch start time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTSWEND</name>
          <description>No Description</description>
          <addressOffset>0x1CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>ANTSWENDTIM</name>
              <description>Ant switch start time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRECPMPATT</name>
          <description>No Description</description>
          <addressOffset>0x1D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PMEXPECTPATT</name>
              <description>Expected PM pattern</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRECPMDET</name>
          <description>No Description</description>
          <addressOffset>0x1D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000017</resetValue>
          <resetMask>0xBEFFC3FF</resetMask>
          <fields>
            <field>
              <name>PMACQUINGWIN</name>
              <description>PM Correlator Size  </description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMCOSTVALTHD</name>
              <description>Min COST Validation for AFC </description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMTIMEOUTSEL</name>
              <description>PM searching timeout Threshold</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHSCALE</name>
              <description>PHASE Scaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMMINCOSTTHD</name>
              <description>Min. Cost thrshold for TRECS PM</description>
              <bitOffset>14</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COSTHYST</name>
              <description>PM Seaching COST HYST</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREAMSCH</name>
              <description>PM detection enable in TRECS </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRECSCFG</name>
          <description>No Description</description>
          <addressOffset>0x1D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00020004</resetValue>
          <resetMask>0x01FF5FFF</resetMask>
          <fields>
            <field>
              <name>TRECSOSR</name>
              <description>TRECS OSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTIMLOSSTHD</name>
              <description>Timing Loss Threshold</description>
              <bitOffset>3</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTIMLOSSEN</name>
              <description>ENABLE TIMING LOSS DETECTION</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMOFFSET</name>
              <description>PM SCH ADRESS offsrt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGANTPATT</name>
          <description>No Description</description>
          <addressOffset>0x1DC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFGANTPATTVAL</name>
              <description>CFGANTPATTVAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COCURRMODE</name>
          <description>No Description</description>
          <addressOffset>0x1E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>CONCURRENT</name>
              <description>CONCURRENT MODE Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE00</name>
          <description>No Description</description>
          <addressOffset>0x1E4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>SET0COEFF0</name>
              <description>SET 0 CHF COE0 </description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET0COEFF1</name>
              <description>SET 0 CHF COE1 </description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET0COEFF2</name>
              <description>SET 0 CHF COE2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE01</name>
          <description>No Description</description>
          <addressOffset>0x1E8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFFF</resetMask>
          <fields>
            <field>
              <name>SET0COEFF3</name>
              <description>SET 0 CHF COE3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET0COEFF4</name>
              <description>SET 0 CHF COE4</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE02</name>
          <description>No Description</description>
          <addressOffset>0x1EC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>
          <fields>
            <field>
              <name>SET0COEFF5</name>
              <description>SET 0 CHF COE5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET0COEFF6</name>
              <description>SET 0 CHF COE6</description>
              <bitOffset>11</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE03</name>
          <description>No Description</description>
          <addressOffset>0x1F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>SET0COEFF7</name>
              <description>SET 0 CHF COE7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET0COEFF8</name>
              <description>SET 0 CHF COE8</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE04</name>
          <description>No Description</description>
          <addressOffset>0x1F4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>SET0COEFF9</name>
              <description>SET 0 CHF COE9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET0COEFF10</name>
              <description>SET 0 CHF COE10</description>
              <bitOffset>14</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE05</name>
          <description>No Description</description>
          <addressOffset>0x1F8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>SET0COEFF11</name>
              <description>SET 0 CHF COE11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET0COEFF12</name>
              <description>SET 0 CHF COE12</description>
              <bitOffset>14</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE06</name>
          <description>No Description</description>
          <addressOffset>0x1FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SET0COEFF13</name>
              <description>SET 0 CHF COE13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET0COEFF14</name>
              <description>SET 0 CHF COE14</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE10</name>
          <description>No Description</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>SET1COEFF0</name>
              <description>SET 1 CHF COE0 </description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET1COEFF1</name>
              <description>SET 1 CHF COE1 </description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET1COEFF2</name>
              <description>SET 1 CHF COE2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE11</name>
          <description>No Description</description>
          <addressOffset>0x204</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFFF</resetMask>
          <fields>
            <field>
              <name>SET1COEFF3</name>
              <description>SET 1 CHF COE3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET1COEFF4</name>
              <description>SET 1 CHF COE4</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE12</name>
          <description>No Description</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>
          <fields>
            <field>
              <name>SET1COEFF5</name>
              <description>SET 1 CHF COE5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET1COEFF6</name>
              <description>SET 1 CHF COE6</description>
              <bitOffset>11</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE13</name>
          <description>No Description</description>
          <addressOffset>0x20C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>SET1COEFF7</name>
              <description>SET 1 CHF COE7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET1COEFF8</name>
              <description>SET 1 CHF COE8</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE14</name>
          <description>No Description</description>
          <addressOffset>0x210</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>SET1COEFF9</name>
              <description>SET 1 CHF COE9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET1COEFF10</name>
              <description>SET 1 CHF COE10</description>
              <bitOffset>14</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE15</name>
          <description>No Description</description>
          <addressOffset>0x214</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>SET1COEFF11</name>
              <description>SET 1 CHF COE11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET1COEFF12</name>
              <description>SET 1 CHF COE12</description>
              <bitOffset>14</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFCOE16</name>
          <description>No Description</description>
          <addressOffset>0x218</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SET1COEFF13</name>
              <description>SET 1 CHF COE13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SET1COEFF14</name>
              <description>SET 1 CHF COE14</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
